# **Books (Core)**

-----------------

## *Jaco van Wyk*

In [1]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection = "mysql+pymysql://root:root@localhost/books"

In [4]:
engine = create_engine(connection)

In [5]:
create_database(connection)

In [6]:
database_exists(connection)

True

In [12]:
import pandas as pd
df_users = pd.read_csv('C:\\Users\\javwyk\OneDrive - MMI HOLDINGS LTD\Jaco Van Wyk\\Data science bootcamp\\Data\\users.csv')
df_users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [13]:
df_books = pd.read_csv('C:\\Users\\javwyk\OneDrive - MMI HOLDINGS LTD\Jaco Van Wyk\\Data science bootcamp\\Data\\books.csv')
df_books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [14]:
df_authors = pd.read_csv('C:\\Users\\javwyk\OneDrive - MMI HOLDINGS LTD\Jaco Van Wyk\\Data science bootcamp\\Data\\authors.csv')
df_authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [15]:
df_favorites = pd.read_csv('C:\\Users\\javwyk\OneDrive - MMI HOLDINGS LTD\Jaco Van Wyk\\Data science bootcamp\\Data\\favorites.csv')
df_favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [16]:
df_users.to_sql('users', engine, if_exists = 'replace')

3

In [17]:
df_books.to_sql('books', engine, if_exists = 'replace')

6

In [18]:
df_authors.to_sql('authors', engine, if_exists = 'replace')

5

In [19]:
df_favorites.to_sql('favorites', engine, if_exists = 'replace')

7

In [20]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [21]:
q = """
select title
from books b
join favorites f on b.id = f.book_id
where f.user_id in
	(select id from users where first_name = 'John' and last_name = 'Doe')
"""
pd.read_sql(q, engine)

              title
0       The Shining
1                It
2  The Great Gatsby